app/controllers/categories_controller.rb

  def edit
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"

  def show
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "categories".* FROM "categories"