app/views/images/new.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :image_title %>
    <%= f.select :category_id, Category.all.collect { |category| [category.name, category.id] }, { :include_blank => 'Select One' }, class:'form-control' %>